<html>
<head>
<title>Visual InterDev</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="stylesheet.css" type="text/css">
<SCRIPT ID=clientEventHandlersJS LANGUAGE=javascript>
<!--

function window_onload() {
 parent.set_Titel("Visual InterDev");
 parent.set_Status("loading ready");

 return true;
}

//-->
</SCRIPT>
</head>

<body bgcolor="#FFFFFF" text="#000000" LANGUAGE=javascript onload="return window_onload()">
<p class="standard">Dieses Programm ist mein Favorit f&uuml;r JavaScript. Das 
  Programm ist speziell f&uuml;r Skriptsprachen auf HTML-Seiten, dass hei&szlig;t 
  VBScript und JavaScript. Es ist au&szlig;erdem m&ouml;glich, diesen Skript clientseitig 
  under serverseitig zu schreiben (wenn serverseitig, dann f&uuml;r ASP-Seiten). 
  Kombinationen sind selbstverst&auml;ndlich auch m&ouml;glich.</p>
<p class="standard">Das Programm liefert gleichzeitig auch einen kleinen HTML-Editor 
  mit, da JavaScript ja in diesen HTML-Code eingef&uuml;gt wird, allerdings kann 
  ich diesen HTML-Editor nicht sehr empfehlen, da er nur sehr beschr&auml;nkte 
  M&ouml;glichkeiten bietet und haupts&auml;chlich nur Objekte f&uuml;r JavaScript 
  anbietet (also Buttons, Text-Felder, etc.). Au&szlig;erdem wird der HTML-Code 
  damit sehr unsauber. Ich arbeite deshalb in dem Programm eigentlich nur direkt 
  im HTML-Code und dort bei der entsprechenden Skriptsprache.</p>
<p class="standard">Das Programm zeigt au&szlig;erdem alle Objekte an, die in 
  dieser Seite zu Verf&uuml;gung stehen (einmal nat&uuml;rlich immer &quot;window&quot; 
  und &quot;document&quot;, aber auch weitere, wenn man irgendwelchen Tags Namen 
  gegeben hat). Gleichzeitig zeigt das Programm dann auch alle m&ouml;glichen 
  Ereignisse an und mit einem Mausklick erstellt das Programm automatisch bei 
  dem HTML-Tag den entsprechenden Eintrag und geht dann zu dem JavaScript oder 
  VBScript und erstellt dort eine passende Funktion daf&uuml;r. Dadurch kann man 
  hier fast wie in anderen richtigen Programmiersprachen arbeiten.</p>
<p class="standard">Da das Programm von Microsoft ist, ist die Oberfl&auml;che 
  &auml;hnlich wie bei Visual Basic (auch von Microsoft). Hier ein Screenshot:<br>
  <img src="javascript_entwicklungsumgebung_interdev.gif" width="626" height="443"></p>
<p class="standard">Links sieht man jetzt die Objekte und kann dort dann ein Ereignis 
  ausw&auml;hlen. In der Mitte befinden sich dann wieder die eigentlichen Seiten, 
  die man dort dann bearbeiten kann. Rechts befinden sich 2 Elemente. Das obere 
  zeigt alle Dateien an, die zu dem aktuellen Projekt geh&ouml;ren. Das erm&ouml;glicht 
  eine schnelle Navigation zwischen den einzelnen Seiten. Darunter ist die Eigenschaft-Liste 
  f&uuml;r den aktuellen HTML-Tag, &auml;hnlich wie in Visual Basic.</p>
<p class="standard">Beim Eingeben des Codes hilft das Programm auch, denn es zeigt 
  an, welche Methoden oder Eigenschaften beispielsweise bei einem Objekt vorhanden 
  sind, noch w&auml;hrend man schreibt, so wie auch in anderen richtigen Programmiersprachen.</p>
</body>
</html>
