<html>
<head>
<title>Startseite</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="stylesheet.css" type="text/css">
<SCRIPT ID=clientEventHandlersJS LANGUAGE=javascript>
<!--

function window_onload() {
 parent.set_Titel("Startseite");
 parent.set_Status("loading ready");

 return true;
}

//-->
</SCRIPT>
</head>

<body bgcolor="#FFFFFF" text="#000000" LANGUAGE=javascript onload="return window_onload()">
<p class="standard" align="center"><b>Willkommen auf dieser Site!</b></p>
<p class="standard" align="left">Diese Seite ist f&uuml;r alle, die vor haben, 
  Programmieren zu lernen und auch erfolgreich anzuwenden, aber auch f&uuml;r 
  erfahrene Programmierer zum Nachschlagen. Sie finden hier haupts&auml;chlich 
  Beispiele, Informationen, Erkl&auml;rungen und Tipps zu Visual Basic und JavaScript.</p>
<p class="standard" align="left">Diese beiden Programmiersprachen Visual Basic 
  und JavaScript sind beide extrem leicht und schnell zu erlernen, wobei Visual 
  Basic f&uuml;r die professionelle Programmierung von Windows-Anwendungen gedacht 
  ist und JavaScript eher eine so genannte Skriptsprache ist, was man auch schon 
  im Namen erkennen kann, die f&uuml;r das Erstellen von dynamischen HTML-Seiten 
  gedacht ist.</p>
<p class="standard" align="left"> Bei JavaScript muss man noch dazu sagen, dass 
  es hier 2 verschiedene M&ouml;glichkeiten gibt, diese Skripte anzuwenden. Sie 
  k&ouml;nnen entweder direkt auf dem Webserver ausgef&uuml;hrt werden und liefern 
  dann die fertige HTML-Seite an den Clienten oder sie werden im Browser des Clienten 
  ausgef&uuml;hrt, was allerdings einen gro&szlig;en Nachteil hat, denn die verschiedenen 
  Browser (Internet Explorer, Netscape, ...) f&uuml;hren diesen Code leider etwas 
  unterschiedlich aus. Allerdings ist die erste M&ouml;glichkeit doch noch etwas 
  komplizierter und verlangt einiges an Wissen, so dass ich hier nur auf den normalen 
  client-seitigen Code eingehe.</p>
<p class="standard" align="left">Zur Demonstration von JavaScript wurden diese 
  Seiten &uuml;brigens mit dieser Skriptsprache optimiert. Diese Men&uuml;f&uuml;hrung 
  w&auml;re mit reinem HTML nicht m&ouml;glich. Wenn Sie bereits etwas Erfahrungen 
  mit JavaScript gesammelt haben, k&ouml;nnen Sie selbstverst&auml;ndlich den 
  Code dieser Site betrachten und auch frei kopieren, wenn sie in einem kurzen 
  Kommentar des Codes angeben, dass der Code von mir stammt.</p>
<p class="standard" align="left">Viel Spa&szlig; auf dieser Site und viel Erfolg 
  bei Ihrer zuk&uuml;nftigen Programmierer-Karriere!</p>
</body>
</html>
